OpenFOAM-v1812/applications/test/multiWorld/chtMultiRegionSimpleFoam/fluid/0/topAir/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottom
    {
        type            compressible::turbulentTemperatureCoupledBaffle2Mixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            fixedValue;
        value           uniform 300;
    }
    right
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
}

// ************************************************************************* //
